src/Documents/СчетНаОплатуПокупателю/СчетНаОплатуПокупателю.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СчетНаОплатуПокупателю</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.ТранспортнаяЛогистикаЗаказы</registerRecords>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>АдресДоставкиJSON</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяЛогистикиНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЛогистикиОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеревозкаАвтотранспортом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаСкидки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УдалитьСтатусОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УдалитьУчитыватьНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ea61a478-a96b-4411-9ac1-71d41b80dbb1">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dd379f85-6563-4538-a6ea-7ae2dbb3d72f">
    <name>ДополнительныеУсловия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2a2b8615-5188-44d5-8920-135e9194c8ff">
    <name>КратностьВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8a49b8b6-0b9b-429a-a489-0b7f98763764">
    <name>КурсВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2c0d2377-988c-4d94-8200-0a7c31841293">
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f3489a01-38b8-4842-9bd0-e47a8f62ca17">
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6aef35e7-9bf2-4730-924f-15764f16ab1f">
    <name>ЗаГлавногоБухгалтераНаОсновании</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8708f441-979a-4e8b-a20d-175fc353e61b">
    <name>ЗаРуководителяНаОсновании</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоГосЗакупок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентГосЗакупок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураГосЗакупок</name>
      <type>
        <types>CatalogRef.НоменклатураГосЗакупок</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>4</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЦенаГосЗакупок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвратнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ТранспортнаяЛогистикаЗаказы/ТранспортнаяЛогистикаЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТранспортнаяЛогистикаЗаказы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тоннаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Наценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АдресПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЛогистикиНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЛогистикиОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.Маршруты</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВРейсе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.Доверенность</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ЗаказыКлиентов/ЗаказыКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыКлиентов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/СчетНаОплатуПокупателю/ObjectModule.bsl
&После("ОбработкаПроведения")
Процедура Базар_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	СписокОшибокПриПроведении = Неопределено;
	
	ГосЗакупкиСервер.ОбработкаПроведенияГосЗакупки(ЭтотОбъект, СписокОшибокПриПроведении, Отказ);
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(СписокОшибокПриПроведении, Отказ);
	
	ДвиженияТранспортнаяЛогистикаЗаказы(Отказ);
	ДвиженияЗаказыКлиентов(Отказ);
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура Базар_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() тогда
		
		СуммаВключаетНДС = Истина;
		
		Если НЕ ЗначениеЗаполнено(Склад) тогда
			СистемныеНастройкиБазар = ОбщегоНазначенияБазарСервер.СистемныеНастройкиБазар(Дата);
			Если ЗначениеЗаполнено(СистемныеНастройкиБазар.СкладОтгрузки) тогда
				Склад = СистемныеНастройкиБазар.СкладОтгрузки;
			КонецЕсли;
			Если ЗначениеЗаполнено(СистемныеНастройкиБазар.ТипЦенПродажи) И НЕ ЗначениеЗаполнено(ТипЦен) тогда
				ТипЦен = СистемныеНастройкиБазар.ТипЦенПродажи;
			КонецЕсли;
		КонецЕсли;
		
		ДанныеТранспортнойЛогистики = ТранспортнаяЛогистикаСервер.ДанныеТранспортнойЛогистики(ЭтотОбъект, Неопределено, ДанныеЗаполнения);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеТранспортнойЛогистики);
		
	КонецЕсли;
	
КонецПроцедуры

&Перед("ОбработкаПроверкиЗаполнения")
Процедура Базар_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("ДоговорКонтрагента");
	ПроверяемыеРеквизиты.Добавить("Товары.Цена");
	ПроверяемыеРеквизиты.Добавить("Товары.Количество");
	
	Если ГосЗакупкиСервер.ЭтоДоговорПоставкиГосЗакупок(ДоговорКонтрагента) тогда
		ПроверяемыеРеквизиты.Добавить("Товары.ЦенаГосЗакупок");
		ПроверяемыеРеквизиты.Добавить("Товары.КоличествоГосЗакупок");
	КонецЕсли;
	
	ПроверяемыеРеквизиты.Добавить("Товары.Сумма");
	
	Если ПеревозкаАвтотранспортом тогда
		ПроверяемыеРеквизиты.Добавить("АдресДоставки");
		ПроверяемыеРеквизиты.Добавить("ВремяЛогистикиНачало");
		ПроверяемыеРеквизиты.Добавить("ВремяЛогистикиОкончание");
	КонецЕсли;
	
КонецПроцедуры

&После("ПриКопировании")
Процедура Базар_ПриКопировании(ОбъектКопирования)
		
	Если НЕ ЗначениеЗаполнено(Склад) тогда
		СистемныеНастройкиБазар = ОбщегоНазначенияБазарСервер.СистемныеНастройкиБазар(Дата);
		Если ЗначениеЗаполнено(СистемныеНастройкиБазар.СкладОтгрузки) тогда
			Склад = СистемныеНастройкиБазар.СкладОтгрузки;
		КонецЕсли;
		Если ЗначениеЗаполнено(СистемныеНастройкиБазар.ТипЦенПродажи) И НЕ ЗначениеЗаполнено(ТипЦен) тогда
			ТипЦен = СистемныеНастройкиБазар.ТипЦенПродажи;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеТранспортнойЛогистики = ТранспортнаяЛогистикаСервер.ДанныеТранспортнойЛогистики(ЭтотОбъект, Неопределено, ОбъектКопирования);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеТранспортнойЛогистики);
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура Базар_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Заполнение даты документа
	ФиксированноеВремяДокументов.УстановитьВремяНовогоДокумента(ЭтотОбъект, Отказ);
	
	Если НЕ Отказ тогда
		
		Если НЕ ЗначениеЗаполнено(Грузополучатель) тогда
			Грузополучатель = Контрагент;
		КонецЕсли;
		
		Если НЕ ЭтоНовый() тогда
			Если НЕ Проведен ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения тогда
				ДвиженияТранспортнаяЛогистика = Движения.ТранспортнаяЛогистикаЗаказы;
				ДвиженияТранспортнаяЛогистика.Очистить();
				ДвиженияТранспортнаяЛогистика.Записать();
				
				ДвиженияЗаказыКлиентов = Движения.ЗаказыКлиентов;
				ДвиженияЗаказыКлиентов.Очистить();
				ДвиженияЗаказыКлиентов.Записать();
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияТранспортнаяЛогистикаЗаказы(Отказ)
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияТранспортнаяЛогистика = Движения.ТранспортнаяЛогистикаЗаказы;
	ДвиженияТранспортнаяЛогистика.Очистить();
	
	Если НЕ ПеревозкаАвтотранспортом тогда
		ДвиженияТранспортнаяЛогистика.Записать();
		Возврат;
	КонецЕсли;
	
	СистемныеНастройкиБазар = ОбщегоНазначенияБазарСервер.СистемныеНастройкиБазар(Дата);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("ТипЦенСебестоимости", СистемныеНастройкиБазар.ТипЦенСебестоимость);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетНаОплатуПокупателюТовары.Ссылка.Организация КАК Организация,
	|	СчетНаОплатуПокупателюТовары.Ссылка КАК ДокументДвижения,
	|	СчетНаОплатуПокупателюТовары.Ссылка.АдресДоставки КАК АдресПредставление,
	|	СчетНаОплатуПокупателюТовары.Ссылка.ВремяЛогистикиНачало КАК ВремяЛогистикиНачало,
	|	СчетНаОплатуПокупателюТовары.Ссылка.ВремяЛогистикиОкончание КАК ВремяЛогистикиОкончание,
	|	СчетНаОплатуПокупателюТовары.Ссылка.Грузоотправитель КАК Грузоотправитель,
	|	СчетНаОплатуПокупателюТовары.Ссылка.Грузополучатель КАК Грузополучатель,
	|	СчетНаОплатуПокупателюТовары.Номенклатура КАК Номенклатура,
	|	СУММА(СчетНаОплатуПокупателюТовары.Количество) КАК Количество,
	|	СУММА(СчетНаОплатуПокупателюТовары.Количество * СчетНаОплатуПокупателюТовары.Номенклатура.ВесЕдиницы) КАК Тоннаж,
	|	СУММА(СчетНаОплатуПокупателюТовары.Наценка) КАК Наценка
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	|ГДЕ
	|	СчетНаОплатуПокупателюТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетНаОплатуПокупателюТовары.Ссылка.Организация,
	|	СчетНаОплатуПокупателюТовары.Ссылка,
	|	СчетНаОплатуПокупателюТовары.Ссылка.АдресДоставки,
	|	СчетНаОплатуПокупателюТовары.Ссылка.ВремяЛогистикиНачало,
	|	СчетНаОплатуПокупателюТовары.Ссылка.ВремяЛогистикиОкончание,
	|	СчетНаОплатуПокупателюТовары.Ссылка.Грузоотправитель,
	|	СчетНаОплатуПокупателюТовары.Ссылка.Грузополучатель,
	|	СчетНаОплатуПокупателюТовары.Номенклатура";
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		НоваяЗапись = ДвиженияТранспортнаяЛогистика.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,Выборка);
		
		НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Регистратор = Ссылка;
		
		Если НЕ ЗначениеЗаполнено(Выборка.Грузоотправитель) тогда
			НоваяЗапись.Грузоотправитель = Выборка.Организация;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Выборка.Грузополучатель) тогда
			НоваяЗапись.Грузополучатель = Выборка.Контрагент;
		КонецЕсли;
		
		
	КонецЦикла;
	
	ДвиженияТранспортнаяЛогистика.Записать();
	
КонецПроцедуры

Процедура ДвиженияЗаказыКлиентов(Отказ)
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗаказыКлиентов = Движения.ЗаказыКлиентов;
	ДвиженияЗаказыКлиентов.Очистить();
		
	Для Каждого СтрокаТовар из Товары цикл
		
		НоваяЗапись = ДвиженияЗаказыКлиентов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ЭтотОбъект);
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТовар);
		
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Регистратор = Ссылка;
		
		Если НЕ ЗначениеЗаполнено(Грузоотправитель) тогда
			НоваяЗапись.Грузоотправитель = Организация;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Грузополучатель) тогда
			НоваяЗапись.Грузополучатель = Контрагент;
		КонецЕсли;
		
		
	КонецЦикла;
	
	ДвиженияЗаказыКлиентов.Записать();
	
КонецПроцедуры
